In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
import matplotlib.pyplot as plt

<img src="imgs/Screen Shot 2019-08-10 at 10.42.22 AM.png">

In [9]:
data = {
    'Car': 28*['SUV'] + 35*['Sport car']  + 97*['SUV'] + 104*['Sport car'] ,
    'Accident': 28*['yes'] + 35*['yes'] + 97*['no'] + 104*['no']
}

In [10]:
df = DataFrame(data)

In [11]:
df

           Car Accident
0          SUV      yes
1          SUV      yes
2          SUV      yes
3          SUV      yes
4          SUV      yes
..         ...      ...
259  Sport car       no
260  Sport car       no
261  Sport car       no
262  Sport car       no
263  Sport car       no

[264 rows x 2 columns]

In [20]:
g = df.groupby(['Accident', 'Car'])

In [21]:
g.size()

Accident  Car
no        SUV           97
          Sport car    104
yes       SUV           28
          Sport car     35
dtype: int64

In [57]:
two_way_table = pd.crosstab(df['Accident'], df['Car'])

In [58]:
two_way_table

Car       SUV  Sport car
Accident
no         97        104
yes        28         35

In [75]:
freq_table = two_way_table.copy()

In [76]:
freq_table

Car       SUV  Sport car
Accident
no         97        104
yes        28         35

In [77]:
freq_table['SUV'] = two_way_table['SUV'] / two_way_table['SUV'].sum()

In [78]:
freq_table['Sport car'] = two_way_table['Sport car'] / two_way_table['Sport car'].sum()

In [79]:
freq_table

Car         SUV  Sport car
Accident
no        0.776   0.748201
yes       0.224   0.251799

In [81]:
freq_table = freq_table.append(freq_table.sum().rename('Total'))

In [82]:
freq_table

Car         SUV  Sport car
Accident
no        0.776   0.748201
yes       0.224   0.251799
Total     1.000   1.000000

In [66]:
# TODO: adding total to freq tabel 
# TODO: find another way to calculate the freq